In [4]:
#Importing of libraries 
import pandas as pd
import numpy as np

In [5]:
# Reading of files
sales =pd.read_csv(r"C:\Users\juwer\Downloads\Ratails Analytics\sales_data.csv")
customers=pd.read_csv(r"C:\Users\juwer\Downloads\Ratails Analytics\customers.csv")
products=pd.read_csv(r"C:\Users\juwer\Downloads\Ratails Analytics\products.csv")
returns=pd.read_csv(r"C:\Users\juwer\Downloads\Ratails Analytics\returns.csv")
stores=pd.read_csv(r"C:\Users\juwer\Downloads\Ratails Analytics\stores.csv")

# Sales Data Cleaning

In [90]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3060 entries, 0 to 3059
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id       3060 non-null   object
 1   order_date     3060 non-null   object
 2   customer_id    3060 non-null   object
 3   product_id     3060 non-null   object
 4   store_id       2068 non-null   object
 5   sales_channel  3060 non-null   object
 6   quantity       3060 non-null   int64
 7   unit_price     3060 non-null   float64
 8   discount_pct   3060 non-null   float64
 9   total_amount   3060 non-null   float64
dtypes: float64(3), int64(1), object(6)
memory usage: 239.2+ KB

In [91]:
# Finding null values
sales.isnull().sum()

order_id           0
order_date         0
customer_id        0
product_id         0
store_id         992
sales_channel      0
quantity           0
unit_price         0
discount_pct       0
total_amount       0
dtype: int64

In [92]:
# Filling of null values
sales['store_id'] = sales['store_id'].fillna(sales['store_id'].mode()[0])

In [93]:
sales.isnull().sum()

order_id         0
order_date       0
customer_id      0
product_id       0
store_id         0
sales_channel    0
quantity         0
unit_price       0
discount_pct     0
total_amount     0
dtype: int64

In [5]:
# Standardizing Formats
sales.columns = sales.columns.str.strip().str.title()

In [95]:
# Finding duplicates
duplicates = sales[sales.duplicated(subset='Order_Id')]
duplicates.shape[0]

60

In [96]:
# removing duplicates 
sales.drop_duplicates(subset=['Order_Id'], inplace=True)

In [97]:
duplicates = sales[sales.duplicated(subset='Order_Id')]
duplicates.shape[0]

0

In [98]:
# Sorting 
sales = sales.sort_values(by='Order_Id')

In [99]:
# Fixing of Outliers
# Columns to check
cols = ['Quantity', 'Unit_Price', 'Discount_Pct', 'Total_Amount']

# Loop through each column
for col in cols:
    Q1 = sales[col].quantile(0.25)
    Q3 = sales[col].quantile(0.75)
    IQR = Q3 - Q1
    lower = Q1 - 1.5 * IQR
    upper = Q3 + 1.5 * IQR

    # Count outliers
    outlier_count = ((sales[col] < lower) | (sales[col] > upper)).sum()
    print(f"Outliers in '{col}': {outlier_count}")

    # Fix outliers by capping
    sales[col] = sales[col].clip(lower, upper)

Outliers in 'Quantity': 95
Outliers in 'Unit_Price': 0
Outliers in 'Discount_Pct': 0
Outliers in 'Total_Amount': 134

In [6]:
# Checking of data types
sales.dtypes

Order_Id          object
Order_Date        object
Customer_Id       object
Product_Id        object
Store_Id          object
Sales_Channel     object
Quantity           int64
Unit_Price       float64
Discount_Pct     float64
Total_Amount     float64
dtype: object

In [7]:
# Changing of Order_Date datatype
sales['Order_Date'] = pd.to_datetime(sales['Order_Date'], errors='coerce')

In [8]:
sales.dtypes

Order_Id                 object
Order_Date       datetime64[ns]
Customer_Id              object
Product_Id               object
Store_Id                 object
Sales_Channel            object
Quantity                  int64
Unit_Price              float64
Discount_Pct            float64
Total_Amount            float64
dtype: object

In [168]:
# Caluclating profit
sales = sales.merge(products[['Product_Id', 'Cost_Price']], on='Product_Id', how='left')
sales['Profit'] = (sales['Total_Amount'] - (sales['Cost_Price'] * sales['Quantity'])).round(2)

In [169]:
sales.describe()

,Order_Date,Quantity,Unit_Price,Discount_Pct,Total_Amount,Cost_Price,Profit
count,3000,3000.000000,3000.000000,3000.000000,3000.000000,3000.000000,3000.000000
mean,2024-04-07 08:10:04.800000,1.681833,160.575730,0.088183,242.973177,103.542273,68.742440
min,2023-04-11 00:00:00,1.000000,6.770000,0.000000,6.970000,5.290000,-52.520000
25%,2023-10-04 00:00:00,1.000000,83.700000,0.050000,107.760000,54.630000,18.110000
50%,2024-04-08 00:00:00,2.000000,159.700000,0.050000,196.740000,104.170000,48.970000
75%,2024-10-05 00:00:00,2.000000,229.400000,0.200000,337.470000,152.837500,99.680000
max,2025-04-10 00:00:00,3.500000,382.320000,0.200000,682.035000,199.470000,498.460000
std,NaN,0.771936,91.219137,0.074831,180.787599,56.272572,68.679635

In [171]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order_Id       3000 non-null   object
 1   Order_Date     3000 non-null   datetime64[ns]
 2   Customer_Id    3000 non-null   object
 3   Product_Id     3000 non-null   object
 4   Store_Id       3000 non-null   object
 5   Sales_Channel  3000 non-null   object
 6   Quantity       3000 non-null   float64
 7   Unit_Price     3000 non-null   float64
 8   Discount_Pct   3000 non-null   float64
 9   Total_Amount   3000 non-null   float64
 10  Cost_Price     3000 non-null   float64
 11  Profit         3000 non-null   float64
dtypes: datetime64[ns](1), float64(6), object(5)
memory usage: 281.4+ KB

In [172]:
sales.shape

(3000, 12)

In [175]:
# Saving of cleaned data
sales.to_csv('sales_cleaned.csv',index=False)

# Customers Data Cleaning

In [105]:
customers.head()

  customer_id first_name last_name  gender   age signup_date region
0       C0000    Patrick    Morgan    Male  18.0  2024-07-11  South
1       C0001       Eric       Lee   Other  36.0  2020-09-20   East
2       C0002     Thomas      Pena  Female   NaN  2021-03-07   East
3       C0003     Dalton     Duran    Male  24.0  2021-08-29  South
4       C0004     Travis   Mcclain    Male  50.0  2023-03-29  South

In [106]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 816 entries, 0 to 815
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  816 non-null    object
 1   first_name   816 non-null    object
 2   last_name    816 non-null    object
 3   gender       816 non-null    object
 4   age          776 non-null    float64
 5   signup_date  816 non-null    object
 6   region       816 non-null    object
dtypes: float64(1), object(6)
memory usage: 44.8+ KB

In [107]:
# Finding null values
customers.isnull().sum()

customer_id     0
first_name      0
last_name       0
gender          0
age            40
signup_date     0
region          0
dtype: int64

In [108]:
# Filling null values
customers['age'] = customers['age'].fillna(customers['age'].median())

In [109]:
customers.isnull().sum()

customer_id    0
first_name     0
last_name      0
gender         0
age            0
signup_date    0
region         0
dtype: int64

In [110]:
# Standardizing Formats
customers.columns = customers.columns.str.strip().str.title()

In [111]:
# Finding duplicates
duplicates = customers[customers.duplicated(subset='Customer_Id')]
duplicates.shape[0]

16

In [112]:
# Removing duplicate values
customers = customers.drop_duplicates(subset='Customer_Id')

In [113]:
duplicates = customers[customers.duplicated(subset='Customer_Id')]
duplicates.shape[0]

0

In [114]:
# Sorting 
customers = customers.sort_values(by='Customer_Id')

In [115]:
# Finding of outliers

Q1 = customers['Age'].quantile(0.25)
Q3 = customers['Age'].quantile(0.75)
IQR = Q3 - Q1

# Define bounds
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

# Find outliers
outliers = customers[(customers['Age'] < lower_bound) | (customers['Age'] > upper_bound)]
print(f"Number of outliers: {outliers.shape[0]}")

Number of outliers: 0

In [116]:
# Finding datatypes
customers.dtypes

Customer_Id     object
First_Name      object
Last_Name       object
Gender          object
Age            float64
Signup_Date     object
Region          object
dtype: object

In [117]:
# fixing of data type
customers['Signup_Date'] = pd.to_datetime(customers['Signup_Date'])

In [118]:
# Checking of data types
customers.dtypes

Customer_Id            object
First_Name             object
Last_Name              object
Gender                 object
Age                   float64
Signup_Date    datetime64[ns]
Region                 object
dtype: object

In [119]:
# Creating derived columns

def Age_group(age):
    if age < 25:
        return 'Youth'
    elif age < 40:
        return 'Adult'
    elif age < 60:
        return 'Mid-Age'
    else:
        return 'Senior'

customers['Age_group'] = customers['Age'].apply(Age_group)

In [120]:
customers.describe()

              Age          Signup_Date
count  800.000000                  800
mean    44.147500  2022-10-23 04:04:48
min     18.000000  2020-04-11 00:00:00
25%     31.000000  2021-07-13 12:00:00
50%     44.000000  2022-11-22 12:00:00
75%     57.000000  2024-01-15 18:00:00
max     70.000000  2025-04-09 00:00:00
std     14.923694                  NaN

In [121]:
customers.shape

(800, 8)

In [124]:
# Saving of cleaned data
customers.to_csv('customers_cleaned.csv',index=False)

# Products Data Cleaning

In [125]:
products.head()

,product_id,product_name,category,brand,cost_price,unit_price,margin_pct
0,P0000,BrandA Shoulder,Electronics,BrandC,52.75,64.65,18.41
1,P0001,BrandA Responsibility,Electronics,BrandD,11.20,13.26,15.54
2,P0002,BrandB Small,Electronics,BrandB,144.62,250.37,42.24
3,P0003,BrandD Continue,Apparel,BrandD,119.91,219.25,45.31
4,P0004,BrandA Indeed,Apparel,BrandD,71.35,88.47,19.35

In [126]:
# Finding null values
products.isnull().sum()

product_id       0
product_name     0
category         0
brand           60
cost_price       0
unit_price       0
margin_pct       0
dtype: int64

In [127]:
# Filling missing brand values with mode
products['brand']=products['brand'].fillna(products['brand'].mode()[0])

In [128]:
products.isnull().sum()

product_id      0
product_name    0
category        0
brand           0
cost_price      0
unit_price      0
margin_pct      0
dtype: int64

In [129]:
# Standardizing Formats
products.columns = products.columns.str.strip().str.title()

In [130]:
# Finding duplicates
duplicates = products[products.duplicated(subset='Product_Id')]
duplicates.shape[0]

24

In [131]:
# Dropping duplicates based on product_id, keeping the first occurrence
products = products.drop_duplicates(subset='Product_Id', keep='first')

In [132]:
duplicates = products[products.duplicated(subset='Product_Id')]
duplicates.shape[0]

0

In [133]:
# Sorting 
products = products.sort_values(by='Product_Id')

In [134]:
# Defining numeric columns
cols = ['Cost_Price', 'Unit_Price', 'Margin_Pct']

# Loop through each column and count outliers
for col in cols:
    Q1 = products[col].quantile(0.25)
    Q3 = products[col].quantile(0.75)
    IQR = Q3 - Q1
    lower = Q1 - 1.5 * IQR
    upper = Q3 + 1.5 * IQR

    outlier_count = ((products[col] < lower) | (products[col] > upper)).sum()
    print(f"Outliers in '{col}': {outlier_count}")

Outliers in 'Cost_Price': 0
Outliers in 'Unit_Price': 0
Outliers in 'Margin_Pct': 0

In [135]:
# Checking of data types
products.dtypes

Product_Id       object
Product_Name     object
Category         object
Brand            object
Cost_Price      float64
Unit_Price      float64
Margin_Pct      float64
dtype: object

In [136]:
products.describe()

        Cost_Price   Unit_Price   Margin_Pct
count  1200.000000  1200.000000  1200.000000
mean    103.068000   159.561975    33.826383
std      55.964199    90.698730    11.282351
min       5.290000     6.770000     9.120000
25%      54.697500    83.887500    25.282500
50%     104.165000   157.590000    36.225000
75%     151.342500   226.220000    43.152500
max     199.470000   382.320000    49.990000

In [137]:
products

,Product_Id,Product_Name,Category,Brand,Cost_Price,Unit_Price,Margin_Pct
0,P0000,BrandA Shoulder,Electronics,BrandC,52.75,64.65,18.41
1,P0001,BrandA Responsibility,Electronics,BrandD,11.20,13.26,15.54
2,P0002,BrandB Small,Electronics,BrandB,144.62,250.37,42.24
3,P0003,BrandD Continue,Apparel,BrandD,119.91,219.25,45.31
4,P0004,BrandA Indeed,Apparel,BrandD,71.35,88.47,19.35
...,...,...,...,...,...,...,...
1195,P1195,BrandB Challenge,Home & Kitchen,BrandB,15.31,21.82,29.84
1196,P1196,BrandC Better,Electronics,BrandC,61.87,103.64,40.30
1197,P1197,BrandA Own,Apparel,BrandB,154.11,252.57,38.98
1198,P1198,BrandB Your,Home & Kitchen,BrandC,166.23,285.33,41.74
1199,P1199,BrandC Door,Home & Kitchen,BrandC,23.69,38.43,38.36

In [138]:
products.shape

(1200, 7)

In [141]:
# Saving of cleaned data
products.to_csv('products_cleaned.csv',index=False)

# Returns Data Cleaning

In [142]:
returns.head()

  return_id order_id return_date     return_reason
0     R0000   O02237  2024-03-05         Defective
1     R0001   O01700  2025-03-18         Defective
2     R0002   O01451  2025-02-18     Late Delivery
3     R0003   O02759  2023-10-26         Defective
4     R0004   O00415  2024-08-06  No Longer Needed

In [143]:
# Finding null values
returns.isnull().sum()

return_id        0
order_id         0
return_date      0
return_reason    0
dtype: int64

In [144]:
# Standardizing Formats
returns.columns = returns.columns.str.strip().str.title()

In [145]:
# Finding duplicates
duplicates = returns[returns.duplicated(subset='Return_Id')]
duplicates.shape[0]

4

In [146]:
# Dropping duplicates 
returns = returns.drop_duplicates(subset='Return_Id', keep='first').reset_index(drop=True)

In [147]:
duplicates = returns[returns.duplicated(subset='Return_Id')]
duplicates.shape[0]

0

In [148]:
# Sorting 
returns = returns.sort_values(by='Return_Id')

In [149]:
# Checking of datatypes
returns.dtypes

Return_Id        object
Order_Id         object
Return_Date      object
Return_Reason    object
dtype: object

In [150]:
# Chaning of data types
returns['Return_Date'] = pd.to_datetime(returns['Return_Date'])

In [151]:
returns.dtypes

Return_Id                object
Order_Id                 object
Return_Date      datetime64[ns]
Return_Reason            object
dtype: object

In [152]:
returns.describe()

               Return_Date
count                  200
mean   2024-04-23 08:31:12
min    2023-04-16 00:00:00
25%    2023-10-06 12:00:00
50%    2024-04-25 12:00:00
75%    2024-11-09 06:00:00
max    2025-04-10 00:00:00

In [153]:
returns.shape

(200, 4)

In [155]:
# Saving of cleaned data
returns.to_csv('returns_cleaned.csv',index=False)

# Stores Data Cleaning

In [7]:
stores.head()

,store_id,store_name,store_type,region,city,operating_cost
0,S000,Vincent Inc Store,Franchise,West,Chicago,62538.56
1,S001,Wilson Inc Store,Flagship,East,Chicago,26957.43
2,S002,Washington-Trujillo Store,Franchise,North,Los Angeles,66101.63
3,S003,Santana and Sons Store,Franchise,South,Phoenix,71089.40
4,S004,Oconnor-Rhodes Store,Franchise,East,Los Angeles,40965.26

In [157]:
# Finding null values
stores.isnull().sum()

store_id          0
store_name        0
store_type        0
region            0
city              0
operating_cost    0
dtype: int64

In [158]:
# Standardizing Formats
stores.columns = stores.columns.str.strip().str.title()

In [159]:
# Finding duplicates
duplicates = stores[stores.duplicated(subset='Store_Id')]
duplicates.shape[0]

1

In [160]:
# Dropping of duplicates
stores = stores.drop_duplicates(subset='Store_Id', keep='first').reset_index(drop=True)

In [161]:
duplicates = stores[stores.duplicated(subset='Store_Id')]
duplicates.shape[0]

0

In [162]:
# Sorting 
stores = stores.sort_values(by='Store_Id')

In [6]:
# Checking of datatypes
stores.dtypes

store_id           object
store_name         object
store_type         object
region             object
city               object
operating_cost    float64
dtype: object

In [163]:
stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Store_Id        60 non-null     object
 1   Store_Name      60 non-null     object
 2   Store_Type      60 non-null     object
 3   Region          60 non-null     object
 4   City            60 non-null     object
 5   Operating_Cost  60 non-null     float64
dtypes: float64(1), object(5)
memory usage: 2.9+ KB

In [164]:
stores.describe()

       Operating_Cost
count       60.000000
mean     40207.983167
std      19364.560525
min      10215.930000
25%      22349.890000
50%      38748.915000
75%      53200.627500
max      78806.300000

In [167]:
# Saving of cleaned data
stores.to_csv('stores_cleaned.csv',index=False)